# Apple Silicon 开发环境 Brewfile
# 使用方法: brew bundle install

# 终端工具
cask "ghostty"
brew "starship"
brew "tmux"

# 现代CLI工具
brew "ripgrep"              # 极速搜索，替代grep
brew "fd"                   # 智能查找，替代find
brew "bat"                  # 语法高亮，替代cat
brew "eza"                  # 现代列表，替代ls
brew "bottom"               # 系统监控，替代top
brew "dust"                 # 磁盘分析，替代du
brew "procs"                # 进程查看，替代ps
brew "tig"                  # Git TUI界面
brew "jq"                   # JSON处理
brew "yq"                   # YAML处理
brew "zsh-completions"      # 额外的zsh补全
brew "zsh-autosuggestions"  # zsh自动建议
brew "zsh-syntax-highlighting" # zsh语法高亮

# 开发工具
brew "mise"
brew "direnv"
brew "chezmoi"
brew "git"

# 构建工具和开发依赖
brew "autoconf"             # 自动配置工具
brew "automake"             # 自动化构建工具
brew "libtool"              # 库工具
brew "make"                 # 构建工具
brew "cmake"                # 跨平台构建系统
brew "ninja"                # 快速构建系统
brew "pkg-config"           # 包配置工具
brew "gettext"              # 国际化工具
brew "openssl@3"            # SSL/TLS库
brew "curl"                 # 网络传输工具
brew "wget"                 # 文件下载工具
brew "tree"                 # 目录树显示
brew "htop"                 # 进程监控

# 编辑器
cask "trae"
cask "zed"

# 容器运行时
cask "orbstack"

# Kubernetes工具
brew "kubectl"
brew "k9s"

# 数据库工具
cask "sequel-ace"
cask "dbeaver-community"
cask "clickhouse"
brew "mysql-client"
brew "redis"

# AI工具
brew "ollama"
brew "python@3.12"

# 系统效率工具
cask "raycast"
cask "rectangle"
cask "stats"

# 工作流工具
cask "obsidian"
cask "apifox"