# Apple Silicon 开发环境 Brewfile
# 使用方法: brew bundle install

# 终端工具
cask "ghostty"
brew "starship"
brew "tmux"

# 现代CLI工具
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "dust"
brew "procs"
brew "htop"
brew "tig"
tap "clementtsang/bottom"
brew "clementtsang/bottom/bottom"

# 开发工具
brew "mise"
brew "direnv"
brew "chezmoi"
brew "jq"
brew "yq"
brew "git"

# 编辑器
cask "trae"
cask "zed"

# 容器运行时
cask "orbstack"

# Kubernetes工具
brew "kubectl"
brew "k9s"

# 数据库工具
cask "sequel-ace"
cask "dbeaver-community"
cask "clickhouse"
brew "mysql-client"
brew "redis"

# AI工具
brew "ollama"
brew "python@3.12"

# 系统效率工具
cask "raycast"
cask "rectangle"
cask "stats"

# 工作流工具
cask "obsidian"
cask "apifox"